---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalFitting
source: html/7909d5fc-ce46-b455-925d-a0404ff84eef.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalFitting

A mechanical fitting in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class MechanicalFitting : MEPModel
```

## Remarks
The mechanical fitting is only available in the Autodesk Revit MEP product.